Test loss: 0.7936539781570434
Test accuracy: 0.7229


Input Shape: (32, 32, 3)
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_11 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
batch_normalization_12 (Batc (None, 32, 32, 32)        64        
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 14, 14, 64)        18496     
_________________________________________________________________
batch_normalization_13 (Batc (None, 14, 14, 64)        128       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 7, 7, 64)          0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 7, 7, 64)          0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 5, 5, 128)         73856     
_________________________________________________________________
batch_normalization_14 (Batc (None, 5, 5, 128)         256       
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 2, 2, 128)         0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 2, 2, 128)         0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 512)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 256)               131328    
_________________________________________________________________
batch_normalization_15 (Batc (None, 256)               512       
_________________________________________________________________
dropout_9 (Dropout)          (None, 256)               0         
_________________________________________________________________
fc_2 (Dense)                 (None, 128)               32896     
_________________________________________________________________
batch_normalization_16 (Batc (None, 128)               384       
_________________________________________________________________
dropout_10 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 10)                1290      
=================================================================
Total params: 260,106
Trainable params: 258,890
Non-trainable params: 1,216
_________________________________________________________________